{
    "testingMode": false,
    "tests": [{
        "name": "SMTP Test 1-8, 14, 18",
        "id": 1,
        "protocol": "smtp",
        "desc": "Tests the ability of the Vendor to send an email using SMTP protocol with STARTTLS and PLAIN SASL Authentication. The vendor sends email to wellformed1@edge.nist.gov",
        "longDesc": "The credentials for SASL authentication is vendoraccount@hit-testing2.nist.gov / vendortesting123 ",
        "sutRole": "sender",
        "sutHisp": true,
        "sutEdge": true
    }, {
        "name": "SMTP Test 9, 16, 20",
        "id": 16,
        "protocol": "smtp",
        "desc": "Tests the ability  of the Vendor to accept a STARTTLS connection with PLAIN SASL authentication.The test lab should verify the receipt of email with subject 'STARTTLS & PLAIN SASL AUTHENTICATION'",
        "sutRole": "receiver",
        "sutHisp": true,
        "sutEdge": true
    }, {
        "name": "SMTP Test 10",
        "id": 10,
        "protocol": "smtp",
        "desc": "Tests the ability of the Vendor to reject invalid data as part of DATA command. TTT sends an email to Test Address 1(the Vendor) from wellformed3@hit-testing2.nist.gov.",
        "longDesc": "The objective of this test sequence is to determine if an Edge System (e.g., SUT), acting as the receiver, rejects data sent from a HISP (e.g., ETT), acting as the sender, as a component of a successfully established and active session. Successful establishment of an end-point to end-point connection between the SUT and ETT is a necessary function for SMTP Test Case 10 execution.\n The details for conformance testing flow are as follows: The ETT will initiate a connected session with the SUT and attempt to send an invalid data via the DATA command (e.g., bad line feeds).\n This is required test and maintains compliance with the secure health data transport messaging formats, processing requirements, and communication standards for Direct Edge message exchanges. See Section 1.2.1 and 1.2.2 of the ‘Implementation Guide for Direct Edge Protocols’ document. \n The test correlates to Test ID 10 of the SMTP Test Cases (tab) within the ‘DirectEdgeProtocols’ spreadsheet.",
        "sutRole": "receiver",
        "sutHisp": true,
        "sutEdge": true
    }, {
        "name": "SMTP Test 11",
        "id": 11,
        "protocol": "smtp",
        "desc": "Tests the ability of the Vendor to reject bad SMTP commands. The tool will send invalid SMTP commands to intiate the session following exception paths identified in Section 4.1.1 and 4.1.4 of RFC 2821",
        "longDesc": "The objective of this test sequence is to determine if an Edge System (e.g., SUT), acting as the receiver, rejects as invalid the commands sent from a HISP (e.g., ETT), acting as the sender./n The details for conformance testing flow are as follows: The ETT attempts to initiate a session with the SUT by sending an invalid SMTP command following identified exception paths. The test attempts to determine if the SUT rejects the command sent by the Edge Testing Tool as invalid and responds using the appropriate mechanisms. This is conducted in accordance with RFC 2811, Section 4.1.1 and 4.1.4 (e.g., closing the session abruptly).\n This is required test and maintains compliance with the secure health data transport messaging formats, processing requirements, and communication standards for Direct Edge message exchanges. See Section 1.2.1 and 1.2.2 of the ‘Implementation Guide for Direct Edge Protocols’ document. \nThe test correlates to Test ID 11 of the SMTP Test Cases (tab) within the ‘DirectEdgeProtocols’ spreadsheet. ",
        "sutRole": "receiver",
        "sutHisp": true,
        "sutEdge": true
    }, {
        "name": "SMTP Test 13",
        "id": 13,
        "protocol": "smtp",
        "desc": "Tests the timeouts for various SMTP commands. The tool will keep the transaction open for beyond the specified timelimits in RFC 2821 section 4.5.3.2",
        "longDesc": "The objective of this test sequence is to determine if an Edge System (e.g., SUT), acting as the receiver, can successfully establish an active session with a HISP (e.g., ETT), acting as the sender, and conform to the specific timeout requirements within the RFC and SMTP command.\n The details for conformance testing flow are as follows: The ETT will initiate a connected session with the SUT. The SUT will attempt to keep a transaction open with the ETT for beyond the specified time constraints found within RFC 2821, Section 4.5.3.2. \nThis is required test and maintains compliance with the secure health data transport messaging formats, processing requirements, and communication standards for Direct Edge message exchanges. See Section 1.2.1 and 1.2.2 of the ‘Implementation Guide for Direct Edge Protocols’ document. \n The test correlates to Test ID 13 of the SMTP Test Cases (tab) within the ‘DirectEdgeProtocols’ spreadsheet. ",
        "sutRole": "receiver",
        "sutHisp": true,
        "sutEdge": true,
        "fields": [{
            "label": "Command timeout in seconds",
            "name": "sutCommandTimeoutInSeconds",
            "datatype": "String",
            "value": "sutCommandTimeoutInSeconds",
            "readOnly": false,
            "display": true
        }]
    }, {
        "name": "SMTP Test 17",
        "id": 17,
        "protocol": "smtp",
        "desc": "Tests the ability of the Vendor to reject invalid STARTTLS commands.The tool sends invalid STARTTLS commands and check for server behavior.",
        "sutRole": "receiver",
        "sutHisp": true,
        "sutEdge": true
    }, {
        "name": "SMTP MU2 Test 17",
        "id": 117,
        "protocol": "smtp",
        "desc": "Tests the ability of the Vendor to send messages with unique message-IDs. The vendor sends email to wellformed14@edge.nist.gov",
        "sutRole": "sender",
        "sutHisp": true,
        "sutEdge": true
    }, {
        "name": "SMTP MU2 Test 45",
        "id": 145,
        "protocol": "smtp",
        "desc": "Tests the ability of the Vendor to send messages with unique message-IDs. The vendor sends email to wellformed14@edge.nist.gov",
        "sutRole": "sender",
        "sutHisp": true,
        "sutEdge": true
    }, {
        "name": "SMTP MU2 Test 46",
        "id": 146,
        "protocol": "smtp",
        "desc": "Tests the ability of the Vendor to send messages with Disposition Notification Options Header. The vendor sends email to wellformed14@edge.nist.gov",
        "sutRole": "sender",
        "sutHisp": true,
        "sutEdge": true
    }, {
        "name": "SMTP MU2 Test 47",
        "id": 147,
        "protocol": "smtp",
        "desc": "Tests the ability of the Vendor to accept failure messages for some of the recipients. The vendor sends email to a valid and invalid(noaddress@hit-tesitng2.nist.gov) recipients. The vendor needs to check the failure message for invalid recipients.",
        "sutRole": "sender",
        "sutHisp": true,
        "sutEdge": true
    }, {
        "name": "SMTP Test 22",
        "id": 22,
        "protocol": "smtp",
        "desc": "Tests the ability of the Vendor to reject a PLAIN SASL connection. TTT tries to authenticate with the Vendor using bad username/password",
        "longDesc": "The objective of this test sequence is to determine if an Edge System (e.g., SUT), acting as the receiver, will reject and fail to authenticate an invalid PLAIN SASL request sent from a HISP (e.g., ETT), acting as the sender.\nThe details for conformance testing flow are as follows: The ETT will send an invalid PLAIN SASL username/password authentication scheme to the SUT. The SUT will receive the invalid PLAIN SASL username/password, reject the credentials, and fail to established authentication to the ETT. The PLAIN SASL connection mechanisms will conform to the specified requirements within RFC 4616, Section 2.\n This is conditional test and maintains compliance with the secure health data transport messaging formats, processing requirements, and communication standards for Direct Edge message exchanges. See Section 1.2.4 of the ‘Implementation Guide for Direct Edge Protocols’ document.\n The test correlates to Test ID 22 of the SMTP Test Cases (tab) within the ‘DirectEdgeProtocols’ spreadsheet. ",
        "sutRole": "receiver",
        "sutHisp": true,
        "sutEdge": true
    }, {
        "name": "IMAP Test 4-8, 11, 15",
        "id": 204,
        "protocol": "imap",
        "desc": "Tests the ability of the Vendor HISP to implement imap commands.",
        "sutRole": "sender",
        "sutHisp": true,
        "sutEdge": false
    }, {
        "name": "IMAP Test 13",
        "id": 213,
        "protocol": "imap",
        "desc": "Tests the ability of the Vendor HISP to support STARTTLS with TLS_RSA_WITH_RC4_128_MD5 cipher suite.",
        "sutRole": "sender",
        "sutHisp": true,
        "sutEdge": false
    }, {
        "name": "IMAP Test 14",
        "id": 214,
        "protocol": "imap",
        "desc": "Tests the ability of the Vendor HISP to support STARTTLS with TLS_DHE_DSS_WITH_3DES_EDE_CBC_SHA cipher suite.",
        "sutRole": "sender",
        "sutHisp": true,
        "sutEdge": false
    }, {
        "name": "IMAP Test 17",
        "id": 217,
        "protocol": "imap",
        "desc": "Tests the ability of the Vendor HISP to reject incorrect username/password.",
        "sutRole": "sender",
        "sutHisp": true,
        "sutEdge": false
    }]
}
